{"translatedText": "I am Suleiman Abi Sultan, Abu Salim Khan, my mother Sultana Hafsa and Aisha Walid Tawfiq, a friend of Trabzon. I brought joy to my family and I brought blessings and peace to your family, but I brought sorrow to my brothers Orhan and Musa and code code Matgoi from the oppressors against us and I lived my entire childhood with even I, Suleiman, who took lessons from my Roman teachers And I was only six years old, and I loved mountains and stars, and value from high, and coloring numbers, searching for science in Istanbul, and I was ten years old. I am the reader of blessings who asks a lot and who does not convince any young people. Light with metal and stone. I quickly became aware of the real shine and the fake glossiness at first sight. I am Suleiman, who does not forget the thing he learned. I, Suleiman, became the crown prince at the age of 19, and he was in the hands of those who forgot. Today, I walk. I do not rule the honorable inheritance of Sultan Salim Khan’s father. I am the one who is looking for justice. With every step we take in her life, I am the tenth sultan of the Ottoman Empire', 'detectedSourceLanguage': 'ar', 'input': 'انا سليمان ابي سلطان يا ابو سليم خان وامي السلطانه حفصه وعائشه وليد توفيق صديق طرابزون اتيت بالفرح لي عائلتي واتيت بالبركه والسلام باهلك ولكن اتيت بالحسره لاخوتي اورهان وموسى وكود كود ماتوجوي من الظالمين علينا و عشت طفولتي كلها ب حتى انا سليمان الذي اخذت دروس من اساتذه الروم و كان عمري ست سنوات فقط وحب الجبال والنجوم والقيمه من عاليه و تلوين الارقام بحث عن العلم في اسطنبول و عمري عشر سنوات انا القارئ النعم الذي يسال كثيرا والذي لا يقنع باي شباب انا الذي يحفظ السر طوال العمر تعلمت صنع المجوهرات لا تعلم الصبر انا الذي رايت النور بالمعدني والحجر اصبحت اميز بسرعه اللمعه الحقيقيه ولامعه الزائفه من اول نظره انا سليمان الذي لا ينسى الشيء الذي تعلمه انا سليمان اصبحت ولي العهد بعمر 19 عاما وكان بيد حكم من نسي واليوم فامشي لا تولى حكم الميراث الشريف لوالد السلطان سليم خان انا الذي يبحث عن العداله بكل خطوه نمشيها بحياتها انا السلطان العاشر للامبراطوريه العثمانيه"}